In [124]:
# Dependencies
import numpy as np
import pandas as pd

In [125]:
### EXTRACT data from .csv files with Pandas
#dfPew = pd.DataFrame
#dtaFile = 'Resources/pew2013.dta'
#dfPew = pd.read_stata(dtaFile)
#dfPew

In [126]:
dfPop2000 = pd.DataFrame
csvFile = 'Resources/population_by_zip_2000.csv'
dfPop2000 = pd.read_csv(csvFile,delimiter=',',encoding='utf-8',low_memory=False,dtype=str)
dfPop2000.head()

  minimum_age maximum_age  gender population zipcode          geo_id
0          10          14  female         75   39769  8600000US39769
1          85         NaN  female        130   44047  8600000US44047
2          30          34  female         11   42436  8600000US42436
3          22          24    male         22   99685  8600000US99685
4          67          69    male         69   04239  8600000US04239

In [127]:
dfPop2010 = pd.DataFrame
csvFile = 'Resources/population_by_zip_2010.csv'
dfPop2010 = pd.read_csv(csvFile,delimiter=',',encoding='utf-8',low_memory=False,dtype=str)
dfPop2010.head()

  population minimum_age maximum_age  gender zipcode          geo_id
0         50          30          34  female   61747  8600000US61747
1          5          85         NaN    male   64120  8600000US64120
2       1389          30          34    male   95117  8600000US95117
3        231          60          61  female   74074  8600000US74074
4         56           0           4  female   58042  8600000US58042

In [128]:
dfBars = pd.DataFrame
csvFile = 'Resources/8260_1.csv'
dfBars = pd.read_csv(csvFile,delimiter=',',encoding='utf-8',low_memory=False,dtype=str)
dfBars.head()

,id,address,categories,city,country,hours,keys,latitude,longitude,menus,name,postalCode,province,twitter,websites
0,AVweN1T_ByjofQCxwSPL,Syr Airport,Brewery,Syracuse,US,NaN,us/ny/syracuse/syrairport/2098450797,NaN,NaN,NaN,Adirondack Pub,NaN,NY,NaN,NaN
1,AVwdkF9ZIN2L1WUfxDfw,1320 N Doctor Martin Luther King Dr,Office and Cafeteria Brewer's Hill,Milwaukee,US,NaN,us/wi/milwaukee/1320ndoctormartinlutherkingdr/...,NaN,NaN,NaN,The Waterfront Cafe,53212,WI,NaN,NaN
2,AVwdlPkf_7pvs4fz7TMr,608 4th St,Brewery Downtown Clovis,Clovis,US,"[{""day"":""Wed - Sat"",""hour"":""5:00 PM - 8:00 PM""}]",us/ca/clovis/6084thst/-932885010,NaN,NaN,NaN,559 Local Brewing,93612,CA,NaN,http://fresnobrewing.com
3,AVwcucY0kufWRAb5yWbU,1103 Mills St,breweries & brew pubs,Black Earth,US,NaN,us/wi/blackearth/1103millsst/-757413411,43.138995,-89.747904,NaN,Shack The,53515-9454,WI,NaN,NaN
4,AVweCkd5kufWRAb5_eaI,130 W Riverside Dr,Brewery and Gastropub Downtown Jeffersonville,Jeffersonville,US,"[{""day"":""Wed - Thu"",""hour"":""3:00 PM - 9:00 PM""...",us/utica/jeffersonville/130wriversidedr/787280564,NaN,NaN,NaN,Flat12 Bierworks,47130,Utica,flat12bierwerks,http://flat12.me/brewery

In [129]:
### TRANSFORM data
# Convert column headers to list format for easy reference
#columnsPew = dfPew.columns.values.tolist()
columnsPop2000 = dfPop2000.columns.values.tolist()
columnsPop2010 = dfPop2010.columns.values.tolist()
columnsBars = dfBars.columns.values.tolist()
#print('columnsPew: ' + str(columnsPew))
#print()
#print('columnsPop2000: ' + str(columnsPop2000))
#print()
#print('columnsPop2010: ' + str(columnsPop2010))
#print()
#print('columnsBars: ' + str(columnsBars))

In [130]:
dfBars.dropna(subset=['postalCode'],inplace=True) # Drop rows with no zip code listed
dfBars['postalCode'] = dfBars['postalCode'].str.zfill(5) # Prepend '0' if zip code less than 5 digits long
dfBars['postalCode'] = dfBars['postalCode'].str.slice(start=0,stop=5) # Keep only first 5 digits of zip code
bars_columns = ['postalCode','name']
bars_clean = dfBars[bars_columns].copy()
bars_clean
dfBars=bars_clean.rename(columns={'postalCode':'zipcode'})
dfBars.head()

  zipcode                     name
1   53212      The Waterfront Cafe
2   93612        559 Local Brewing
3   53515                Shack The
4   47130         Flat12 Bierworks
5   98072  Redhook Ale Brewery Inc

In [131]:
ZipBars = dfBars.groupby(['zipcode']).count()
ZipBars.sort_values('name',ascending=False,inplace=True)
ZipBars.rename(columns={'name':'bar_count'},inplace=True)
ZipBars.head()

         bar_count
zipcode
04412           57
93446           51
94558           49
95448           44
43215           42

In [132]:
dfPop2010.dropna(subset=['zipcode'],inplace=True)
dfPop2010['zipcode'] = dfPop2010['zipcode'].str.zfill(5)
dfPop2010['zipcode'] = dfPop2010['zipcode'].str.slice(start=0,stop=5)
dfPop2010.head()

  population minimum_age maximum_age  gender zipcode          geo_id
0         50          30          34  female   61747  8600000US61747
1          5          85         NaN    male   64120  8600000US64120
2       1389          30          34    male   95117  8600000US95117
3        231          60          61  female   74074  8600000US74074
4         56           0           4  female   58042  8600000US58042

In [133]:
dfPop2000.dropna(subset=['zipcode'],inplace=True)
dfPop2000['zipcode'] = dfPop2000['zipcode'].str.zfill(5)
dfPop2000['zipcode'] = dfPop2000['zipcode'].str.slice(start=0,stop=5)
dfPop2000.head()

  minimum_age maximum_age  gender population zipcode          geo_id
0          10          14  female         75   39769  8600000US39769
1          85         NaN  female        130   44047  8600000US44047
2          30          34  female         11   42436  8600000US42436
3          22          24    male         22   99685  8600000US99685
4          67          69    male         69   04239  8600000US04239

In [134]:
#dfPop2000['zipcode'].value_counts() # Entries per zip code (population data is divided by age and gender, so we'll need to calculate sums)

In [135]:
#dfPop2010['zipcode'].value_counts() # Entries per zip code (population data is divided by age and gender, so we'll need to calculate sums)

In [136]:
#dfBars['zipcode'].value_counts() # Bars per zip code

In [137]:
# Convert population data to int so we can do math and stuff on it
dfPop2000['population'] = dfPop2010['population'].astype(int)
dfPop2010['population'] = dfPop2010['population'].astype(int)

In [138]:
# Just out of curiosity...
grouped2000 = dfPop2000.groupby(['zipcode','gender'])['population'].sum()
grouped2010 = dfPop2010.groupby(['zipcode','gender'])['population'].sum()
print(grouped2000.head())
print(grouped2010.head())
# Can we calculate sex ratio (male population / female population) in Pandas?

zipcode  gender
00601    female     1469
         male       7665
00602    female     5000
         male       7620
00603    female    14015
Name: population, dtype: int64
zipcode  gender
00602    female    42248
         male      40792
00603    female    56184
         male      53194
00606    female     6694
Name: population, dtype: int64

In [121]:
# Merge 2000 and 2010 population dataframes
#columnsPop2000: ['minimum_age', 'maximum_age', 'gender', 'population', 'zipcode', 'geo_id']

#columnsPop2010: ['population', 'minimum_age', 'maximum_age', 'gender', 'zipcode', 'geo_id']
dfPop = pd.DataFrame
dfPop = dfPop2000.merge(dfPop2010, on='zipcode')

In [122]:
dfPop.rename(columns={'minimum_age_x':'minimum_age_2000','maximum_age_x':'maximum_age_2000','gender_x':'gender_2000','population_x':'population_2000','geo_id_x':'geo_id_2000','population_y':'population_2010','minimum_age_y':'minimum_age_2010','maximum_age_y':'maximum_age_2010','gender_y':'gender_2010','maximum_age_y':'maximum_age_2010','geo_id_y':'geo_id_2010'},inplace=True)

In [123]:
dfPopColumns = ['minimum_age_2000','maximum_age_2000','gender_2000','population_2000','population_2010','minimum_age_2010','maximum_age_2010','gender_2010','maximum_age_2010',]
dfPop = dfPop[dfPopColumns].copy()

In [29]:
dfPop.head()

,minimum_age_2000,maximum_age_2000,gender_2000,population_2000,zipcode,geo_id_2000,population_2010,minimum_age_2010,maximum_age_2010,gender_2010,geo_id_2010
0,10,14,female,50,39769,8600000US39769,79,45,49,female,8600000US39769
1,10,14,female,50,39769,8600000US39769,49,5,9,male,8600000US39769
2,10,14,female,50,39769,8600000US39769,40,15,17,male,8600000US39769
3,10,14,female,50,39769,8600000US39769,53,10,14,male,8600000US39769
4,10,14,female,50,39769,8600000US39769,31,62,64,male,8600000US39769

In [ ]:
dfPop.groupby(['zipcode','gender_2000'])['population_2000'].sum()

In [22]:
### LOAD transformed data into SQL database

# SQL dependencies
import sqlalchemy
from sqlalchemy import create_engine
from config import username, password

In [ ]:
# Create connection to Bars_db
rds_connection_string = username + ':' + password + '@127.0.0.1/Bars_db'
engine = create_engine(f'mysql://{rds_connection_string}')